mono-dispersed_bed/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           ();
    locations         volumeCenters;

    readData ();

    writeData
    (
      Velocity
      Pressure
    );
  };
};
